# taps
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

$ fish
brew "fish"
brew "starship"

# alternatives
brew "bat"
brew "difftastic"  
brew "fd"
brew "glances"
brew "tree"
brew "eddieantonio/eddieantonio/imgcat"

# development tools
brew "git"
brew "git-lfs"
brew "gh"
brew "asdf"

# nerd font
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# 3rd. parties
cask "amethyst"
cask "docker"
cask "emacs"
cask "iterm2"
cask "karabiner-elements"

