# tap
tap 'jakehilborn/jakehilborn'
tap 'homebrew/cask-fonts'

# fish
brew 'fish'
brew 'starship'

# git
brew 'git'
brew 'git-lfs'

# utilities
brew 'bat'
brew 'fd'
brew 'tree'
brew 'glances'
brew 'difftastic'
#brew 'jakehilborn/jakehilborn/displayplacer'

# garage
brew 'asdf'

# casks
cask 'amethyst'
cask 'docker'
cask 'emacs'
cask 'iterm2'
cask 'karabiner-elements'


# fonts
cask 'font-bitstream-vera-sans-mono-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
